In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
df3= pd.DataFrame(randn(5,4),"A B C D E".split(),"W X Y Z".split())

In [4]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Create Columns

In [5]:
df3["new"] = df3["W"] + df3["Y"]

In [6]:
df3

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [7]:
df3["new2"] = df3["X"] * df3["Z"]

In [8]:
df3

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  0.316469
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.193496
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.435932
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.724766
E  0.190794  1.978757  2.605967  0.683509  2.796762  1.352498

# remove columns

In [9]:
df3.drop(["new","new2"], axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df3

          W         X         Y         Z       new      new2
A  2.706850  0.628133  0.907969  0.503826  3.614819  0.316469
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.193496
C -2.018168  0.740122  0.528813 -0.589001 -1.489355 -0.435932
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.724766
E  0.190794  1.978757  2.605967  0.683509  2.796762  1.352498

In [11]:
df3.drop(["new","new2"], axis = 1, inplace = True)

In [12]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# remove rows

In [13]:
df3.drop("E", axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [14]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# loc and iloc

In [16]:
m = np.random.randint(1,30, size = (10,3))

In [17]:
df4 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df4

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

In [19]:
df4.loc[1]

var1    25
var2     8
var3     7
Name: 1, dtype: int32

In [20]:
df4.loc[1:4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13

In [21]:
df4.iloc[1:4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8

In [22]:
df4.index = "a b c d e f g h i j".split()

In [23]:
df4

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8
e     8    16    13
f     1    21    11
g    13    18    25
h    12    20    16
i     2    25     5
j    29    20    19

In [25]:
df4.loc["a": "d"]

   var1  var2  var3
a     8    11    21
b    25     8     7
c    15    10    21
d    19    24     8

In [26]:
df4.iloc[1:4]

   var1  var2  var3
b    25     8     7
c    15    10    21
d    19    24     8

In [27]:
df4.iloc[1,1]

8

In [30]:
df4.loc["b":"d","var2"]

b     8
c    10
d    24
Name: var2, dtype: int32

In [31]:
df4.loc["b":"d",["var2"]]

   var2
b     8
c    10
d    24

In [32]:
df4.loc["b":"d"][["var2"]]

   var2
b     8
c    10
d    24

In [33]:
df4.iloc[1:5,1]

b     8
c    10
d    24
e    16
Name: var2, dtype: int32

In [34]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df3.loc["A"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [38]:
df3.loc[["A"]]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [39]:
df3.iloc[[2]]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [42]:
df3.iloc[:,2]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [43]:
df3.iloc[:,[2]]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [44]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df3.loc["B","Y"]

-0.8480769834036315

In [47]:
df3.loc["B"]["Y"]

-0.8480769834036315

In [50]:
df3.loc[["A","B"],["X","Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [51]:
df3.iloc[[0,1],[1,2]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077